Pandas DataFrame

In [2]:
import pandas as pd

Q1. Write a Pandas program to convert the given array's dataframe
Sample data: {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
Expected Output:
  X   Y Z
0 78 84 86
1 85 94 97
2 96 89 96
3 80 83 72
4 86 86 83

In [8]:
d={'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}

Q2. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

In [ ]:
# Sample DataFrame:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

Q3. Write a Pandas program to display a summary of the basic "information" about the above DataFrame and its data.

Q4. Write a Pandas program to get the first 3 rows of a given DataFrame.

In [ ]:
# Sample DataFrame:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

Q5. Write a Pandas program to select the 'name' and 'score' columns from the above DataFrame.

Q6. Write a Pandas program to select the specified columns and rows from the above DataFrame.
Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.

Q7. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

Q8. Write a Pandas program to count the number of rows and columns of a DataFrame.

Q9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

Q10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).

Q11. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

Q12. Write a Pandas program to change the score in row 'd' to 11.5.

Q13. Write a Pandas program to calculate the sum of the examination attempts by all the students.

Q14. Write a Pandas program to calculate the mean score for each different student in data frame.

Q15. Write a Pandas program to append a new row 'k' to DataFrame with given values for each column. Now delete the new row and return the original data frame.

Q16. Write a Pandas program to sort the data frame first by 'name' in descending order, then by 'score' in ascending order.

Q17. Write a Pandas program to replace the â€˜qualify' column contains the values 'yes' and 'no' with True and False.

Q18. Write a Pandas program to change the name 'James' to 'Suresh' in name column of the data frame.

Q19. Write a Pandas program to delete the 'attempts' column from the DataFrame.

Q20. Write a Pandas program to insert a new column color in existing DataFrame.

In [ ]:
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']

Q21. Write a Pandas program to iterate over rows in a DataFrame and print row name and row score
sample output:
Anastasia 12.5                                                         
Dima 9.0                                                               
Katherine 16.5

In [ ]:
# Sample Python dictionary data and list labels:
exam_data = [{'name':'Anastasia', 'score':12.5}, {'name':'Dima','score':9}, {'name':'Katherine','score':16.5}]

Q22. Write a Pandas program to get list from DataFrame column headers.

In [ ]:
# Sample DataFrame:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

Q23. Write a Pandas program to rename columns of a given DataFrame.

In [ ]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
new_names=['Column1', 'Column2', 'Column3']

Q24. Write a Pandas program to select rows from a given DataFrame based on values in some columns.
filter the rows of colum1 value == 4

In [ ]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)

Q25. Write a Pandas program to change the order of a above DataFrame columns to 'col3', 'col2', 'col1'

Q26. Write a Pandas program to add one row with values 10, 11, 12 in an above DataFrame.

Q27. Write a Pandas program to write above DataFrame to CSV file using tab separator.

Q28. Write a Pandas program to count city wise number of people from a given of data set (city, name of the person).
          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

In [9]:
df1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})
df1

        name         city
0  Anastasia   California
1       Dima  Los Angeles
2  Katherine   California
3      James   California
4      Emily   California
5    Michael  Los Angeles
6    Matthew  Los Angeles
7      Laura      Georgia
8      Kevin      Georgia
9      Jonas  Los Angeles

Q29. Write a Pandas program to delete DataFrame row(s) where value of co12 is not equal to 5

In [10]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Q30. Write a Pandas program to widen output display to see more columns.

In [3]:
import pandas as pd
import numpy as np
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)
print("Original DataFrame")
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Q31. Write a Pandas program to select a row of dataframe by given integer index.
select and display the row with Index=2 of the above DF

Q32. Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.

In [5]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Q33. Write a Pandas program to convert index in to a column of the above dataframe.

Q34. Write a Pandas program to set a value 10.2 for a value 8 in score column using index value.

Q35. Write a Pandas program to count the NaN values in one or more columns in DataFrame.

Q36. Write a Pandas program to drop a list of rows from a specified DataFrame.

In [7]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(d)
droup_rows=[2,4]
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Q37. Write a Pandas program to reset index in a given DataFrame after removing the first two rows

Q38. Write a Pandas program to devide a DataFrame in a ratio 70 : 30

In [8]:
df = pd.DataFrame(np.random.randn(10, 2))
df

          0         1
0 -0.390362  1.830196
1 -0.066930 -0.666358
2 -0.405524 -0.151438
3 -0.095939 -0.414873
4  0.840079 -0.312125
5 -0.727260 -1.161841
6  0.413548  0.490459
7 -0.275665 -2.836929
8 -1.573876 -1.309381
9 -0.060877 -0.184879

Q39. Write a Pandas program to combining two series into a DataFrame.

In [9]:
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
s2 = pd.Series(['10', '20', 'php', '30.12', '40'])

Q40. Write a Pandas program to shuffle a given DataFrame rows.

In [10]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Q41. Write a Pandas program to convert DataFrame column type from string to datetime.

In [11]:
s = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
s

0    3/11/2000
1    3/12/2000
2    3/13/2000
dtype: object

Q42. Write a Pandas program to rename a col2 to Column2 in a given DataFrame.

In [12]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

Q43. Write a Pandas program to get a list of values in col2 in above DataFrame.

Q44. Write a Pandas program to create a DataFrame from a Numpy array and specify the index column and column headers.

Sample Output
          Column1  Column2  Column3
Index1         0      0.0      0.0
Index2         0      0.0      0.0
Index3         0      0.0      0.0
Index4         0      0.0      0.0
Index5         0      0.0      0.0
Index6         0      0.0      0.0
Index7         0      0.0      0.0
Index8         0      0.0      0.0
Index9         0      0.0      0.0
Index10        0      0.0      0.0
Index11        0      0.0      0.0
Index12        0      0.0      0.0
Index13        0      0.0      0.0
Index14        0      0.0      0.0
Index15        0      0.0      0.0

Q45. Write a Pandas program to find the row for where the value of a each col2 is maximum.

In [13]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

Q46. Write a Pandas program to check whether a col4, col1 are present in above DataFrame or not.

Q47. Write a Pandas program to get the row1 value of above DataFrame.

Q48. Write a Pandas program to get the datatypes of columns of a DataFrame.

In [14]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Q49. Write a Pandas program to sort above DataFrame by two columns: attempts, name.

Q50. Write a Pandas program to convert the datatype of a score column from floats to int.

Q51. Write a Pandas program to append df1 to an empty DataFrame.

In [ ]:
df1 = pd.DataFrame({"col1": range(3),"col2": range(3)})
df1

Q52. Write a Pandas program to replace infinite values with Nan values.

In [16]:
df = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
df

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     inf
5    -inf

Q53. Write a Pandas program to insert a col1 at a column index 0 in a DataFrame.

In [17]:
d = {'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
col1 = [1, 2, 3, 4, 7] 
df = pd.DataFrame(data=d)
df

   col2  col3
0     4     7
1     5     8
2     6    12
3     9     1
4     5    11

Q54. Write a Pandas program to convert a given list of lists into a Dataframe. use 0th list as df column names

In [ ]:
my_lists = [['col1', 'col2'], [2, 4], [1, 3]]

Q55. Write a Pandas program to group by the first column and get second column as lists in rows.

output:
Group on the col1:
col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]

In [18]:
df = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
df

  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5

Q56. Write a Pandas program to get column index for col2.

In [19]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

Q57. Write a Pandas program to count number of columns of above DataFrame.

Q58. Write a Pandas program to select all columns, except col3 in above DataFrame.

Q59. Write a Pandas program to get first 3 records of above DataFrame

Q60. Write a Pandas program to get last 3 records of a DataFrame.

Q61. Write a Pandas program to get topmost 3 records within each column (col1,col2,col3) of above DataFrame.

Q62. Write a Pandas program to remove first 3 rows of above given DataFrame.

Q63. Write a Pandas program to remove last 3 rows of a given DataFrame.

Q64. Write a Pandas program to add a prefix or suffix to all columns of a given DataFrame.
output:
Add prefix:
   A_W  A_X  A_Y  A_Z
0   68   78   84   86
....

Add suffix:
   W_1  X_1  Y_1  Z_1
0   68   78   84   86
....

In [20]:
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
df

    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

Q65. Write a Pandas program to reverse order (rows, columns) of above DataFrame.
Reverse column order:
    Z   Y   X   W
0  86  84  78  68
1  97  94  85  75
2  96  89  96  86
3  72  83  80  80
4  83  86  86  66

Reverse row order:
    W   X   Y   Z
4  66  86  86  83
3  80  80  83  72
2  86  96  89  96
1  75  85  94  97
0  68  78  84  86

Q66. Write a Pandas program to select columns by data type (number, object) of a given DataFrame.

In [21]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Q67. Write a Pandas program to split above DataFrame into two random subsets.

Q68. Write a Pandas program to rename all column names by Remove trailing (at the end) whitesapce and convert to lowercase.

Q69. Write a Pandas program to merge datasets df2, df3 and check uniqueness.

In [ ]:
df1 = df.copy(deep = True)
df2 = df.drop([0, 1])
df3 = df1.drop([2])
"one_to_oneâ€: check if merge keys are unique in both left and right datasets:"'
"one_to_manyâ€ or â€œ1:mâ€: check if merge keys are unique in left dataset:'â€œmany_to_oneâ€ or â€œm:1â€: check if merge keys are unique in right dataset:''

Q70. Write a Pandas program to convert continuous values of a column in above DataFrame to categorical.

Q71. Write a Pandas program to display memory usage of a given DataFrame and every column of the DataFrame.

Q72. Write a Pandas program to combine many given series to create a DataFrame.

In [22]:
sr1 = pd.Series(['php', 'python', 'java', 'c#', 'c++'])
sr2 = pd.Series([1, 2, 3, 4, 5])

Q73. Write a Pandas program to create DataFrames that contains random values, contains missing values, contains datetime values and contains mixed values.

Q74. Write a Pandas program to fill missing values in time series data.

From Wikipedia , in the mathematical field of numerical analysis, interpolation is a type of estimation, a method of constructing new data points within the range of a discrete set of known data points.

In [23]:
sdata = {"c1":[120, 130 ,140, 150, np.nan, 170], "c2":[7, np.nan, 10, np.nan, 5.5, 16.5]}
df = pd.DataFrame(sdata)
df

      c1    c2
0  120.0   7.0
1  130.0   NaN
2  140.0  10.0
3  150.0   NaN
4    NaN   5.5
5  170.0  16.5

Q75. Write a Pandas program to use a local variable within a query.

In [24]:
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
df

    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

Q76. Write a Pandas program to clean object column with mixed data of a given DataFrame using regular expression.

In [25]:
d = {"agent": ["a001", "a002", "a003", "a003", "a004"], "purchase":[4500.00, 7500.00, "$3000.25", "$1250.35", "9000.00"]}
df = pd.DataFrame(d)
df

  agent  purchase
0  a001      4500
1  a002      7500
2  a003  $3000.25
3  a003  $1250.35
4  a004   9000.00

Q77. Write a Pandas program to get the numeric representation of an array by identifying distinct values of a given column of a DataFrame.

In [26]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Q78. Write a Pandas program to replace the current value in a dataframe column based on last largest value. If the current value is less than last largest value replaces the value with 0.

In [ ]:
df1=pd.DataFrame({'rnum':[23, 21, 27, 22, 34, 33, 34, 31, 25, 22, 34, 19, 31, 32, 19]})

Q79. Write a Pandas program to create a DataFrame from the clipboard (data from an Excel spreadsheet or a Google Sheet).

Q80.Write a Pandas program to check for inequality of two given DataFrames.

In [ ]:
df1 = pd.DataFrame({'W':[68,75,86,80,None],'X':[78,85,None,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
df2 = pd.DataFrame({'W':[78,75,86,80,None],'X':[78,85,96,80,76], 'Y':[84,84,89,83,86],'Z':[86,97,96,72,83]});
df1
df2

Q81. Write a Pandas program to get lowest n records within each group of a given DataFrame.

In [27]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11